Repository: hfukuchi/Linux_Kernel_Community_Enforcement_Statement
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: A key goal of all enforcement of the GPL-2.0 license has and continues to be bringing companies into compliance with the terms of the license. The Kernel Enforcement Statement is designed to do just that.
ja: GPL 2.0ライセンス遵守の重要なゴールは、企業をライセンス コンプライアンス遵守状態にし続けることです。Kernel Enforcement Statement（https://lkml.org/lkml/2017/10/16/122）は、まさにこれを行うために作られました。

source: As Greg always says every year, the kernel continues to change faster this year than the last, this year we were running around 8.5 changes an hour, with 10,000 lines of code added, 2,000 modified, and 2,500 lines removed every hour of every day.
ja: 毎年いつもグレッグが話していますが、Kernelは今年も引き続き前年より速く変化しました。毎日、毎時間の努力の結果、全体として10,000行のコード追加、2,000行の変更、2,500行の削除がなされ、私たちは1時間あたり約8.5の変更を取り込んだことになります。

source: At this point, there is no lack of clarity on the base compliance expectations of our community.
ja: この点において、私たちのコミュニティが基本的なコンプライアンスについて何を期待しているかは完全に明白です。

source: Because of this, and to help clarify what the majority of Linux kernel community members feel is the correct way to enforce our license, the Technical Advisory Board of the Linux Foundation has worked together with lawyers in our community, individual developers, and many companies that participate in the development of, and rely on Linux, to draft a Kernel Enforcement Statement to help address both this specific issue we are facing today, and to help prevent any future issues like this from happening again.
ja: 上記、および、Linux Kernelコミュニティの大多数のメンバーの思いを明確にすることは、私たちのライセンスを遵守してもらうための正しい方法であるという理由から、Linux FoundationのTechnical Advisory Board（https://www.linuxfoundation.org/about/technical-advisory-board/）は、コミュニティ内の弁護士、個々の開発者およびLinuxの開発や利用を行う多くの企業とともに、Kernel Enforcement Statementを起草しました。これが書かれたのは、私たちが今日直面している具体的な問題に対して意見表明するとともに、将来同じ問題が起きないようにするためです。

source: By Greg Kroah-Hartman, Chris Mason, Rik van Riel, Shuah Khan, and Grant Likely
ja: グレッグ クロー ハートマン、クリス メイソン、リック ヴァン リール、シュア カーン、グラント ライクリー著

source: Community Conferences: FSFE Free Software Legal and Licensing Workshop, FOSDEM, Open Compliance Summit, and others
ja: コミュニティ会議：FSFE Free Software Legal and Licensing Workshop（https://fsfe.org/activities/ftf/legal-conference.en.html）、FOSDEM（https://fosdem.org/2018/）、Open Compliance Summit など

source: Compliance Communities: OpenChain, SPDX
ja: コンプライアンス コミュニティ：OpenChain（https://www.openchainproject.org/）、SPDX（https://spdx.org/）

source: Compliance Guides: Guide to GPL Compliance, Second Edition, Practical GPL Compliance, Open Source Compliance in the Enterprise
ja: コンプライアンス ガイド：Guide to GPL Compliance, Second Edition（https://www.softwarefreedom.org/resources/2014/SFLC-Guide_to_GPL_Compliance_2d_ed.html）、Practical GPL Compliance、Open Source Compliance in the Enterprise（https://www2.thelinuxfoundation.org/open-source-compliance-ebook）

source: Even today, 26 years after the initial creation of the Linux kernel, the kernel developer community continues to grow, with more than 500 different companies and over 4,000 different developers getting changes merged into the tree during the past year.
ja: 過去1年に500以上の企業と4,000人を超える開発者が開発ツリーに変更を加えていることからもわかるように、Linux Kernelが世に出てから26年を経過した今日でさえ、Kernel開発者コミュニティは成長を続けています。

source: Examples of these claims have been distributing over-the-air firmware, requiring a cell phone maker to deliver a paper copy of source code offer letter; claiming the source code server must be setup with a download speed as fast as the binary server based on the “equivalent access” language of Section 3; requiring the GPL-2.0 to be delivered in a local language; and many others.
ja: これらの主張には、（無線通信やWiFiなど）無線によるファームウェア頒布でも、携帯電話機器メーカーはソースコード入手のための書面による申し出を紙で配布する必要がある、第3節の「equivalent access」という用語を根拠に、ソースコード サーバーはバイナリー サーバーと同じダウンロード速度を提供しなくてはならない、GPL 2.0を現地の言語に翻訳して提供することを要求する、など他にも多数ありました。

source: Further, the Netfilter community suspended Patrick from contributing for violations of their principles of enforcement.
ja: さらに、ネットフィルター コミュニティは、コンプライアンス遵守に関する彼らの原理（https://netfilter.org/files/statement.pdf）を破ったという理由で、パトリックがコード貢献できないようにしました。（https://marc.info/?l=netfilter-devel&m=146887464512702）

source: How he goes about this activity was recently documented very well by Heather Meeker.
ja: 彼がこの活動をどのように続けてきたかは、最近ヘザー ミーカーによって実に良い文書にまとめられました。

source: However, he has also made claims based on ambiguities in the GPL-2.0 that no one in our community has ever considered part of compliance.
ja: しかしながら、彼はさらに、かつて私たちのコミュニティの誰もコンプライアンスに関係すると考えていなかったGPL 2.0にあるあいまいな点を根拠に権利主張をしました。

source: In particular, issues have arisen as a developer from the Netfilter community, Patrick McHardy, has sought to enforce his copyright claims in secret and for large sums of money by threatening or engaging in litigation.
ja: 特に、ネットフィルター コミュニティ出身の開発者パトリック マッカーディが、密かに訴訟を暗示し、時によっては実際に訴訟を起こし、多額の金銭を要求する形で自分の著作権を行使するという問題が起こりました。

source: Kernel developers in our ecosystem may put their own acknowledgement to the Statement by sending a patch to Greg adding their name to the Statement, like any other kernel patch submission, and it will be gladly merged.
ja: 私たちのエコシステムのKernel開発者は、他のKernelパッチと同じように、声明（Statement）への彼ら自身による承認をパッチの形でグレッグへ送ることができます。それらは喜んでマージされるでしょう。

source: Linux Kernel Community Enforcement Statement
ja: ライセンス遵守に関するLinux Kernelコミュニティによる声明

source: Note, a number of questions did come up when this was discussed with the kernel developer community.
ja: 注：これがKernel開発者コミュニティと議論されたときに、多くの質問が出ました。

source: Numerous active contributors to the kernel community have tried to reach out to Patrick to have a discussion about his activities, to no response.
ja: Kernelコミュニティの多数の開発者たちが、彼の活動について議論するためにパトリックと連絡を取ろうとしましたが、返事はもらえませんでした。

source: OCT 16TH, 2017
ja: 2017年10月16日 木曜日

source: Our goals as an ecosystem are to make sure new participants are made aware of those expectations and the materials available to assist them, and to help them grow into our community.
ja: エコシステムとしての私たちのゴールは、新規参加者がコミュニティの期待を認識してもらうとともに、彼らを手助けし、私たちのコミュニティの一員になるように促す資料を提供することです。

source: Please see Greg’s FAQ post answering the most common ones if you have further questions about this topic.
ja: このトピックについて質問があるときには、共通の質問に答えているGreg’s FAQ（http://kroah.com/log/blog/2017/10/16/linux-kernel-community-enforcement-statement-faq/）を見て下さい。

source: Posted by Greg Kroah-Hartman Oct 16th, 2017 enforcement, kernel, linux, statement
ja: 投稿グレッグ クロー ハートマン 2017年10月16日木曜日enforcement, kernel, linux, statement

source: Some of his compliance claims are issues that should and could easily be resolved.
ja: 彼が主張したコンプライアンス問題のいくつかは、簡単に解決できるもので、そうするべきです。

source: Some of these activities include:
ja: これらの活動は以下を含みます：

source: The Netfilter community also published their own FAQ on this matter.
ja: ネットフィルター コミュニティは、この件に関して自分たちで作成したFAQ（https://netfilter.org/licensing.html#faq）を公開しています。

source: The Linux kernel ecosystem of developers, companies and users has been wildly successful by any measure over the last couple decades.
ja: 開発者、企業、ユーザーが作り上げているLinux Kernelエコシステム（業界全体のビジネス構造）は、いかなる基準においても、過去20年に渡って異常ともいえる成功を成し遂げています。

source: The stunning growth and widespread adoption of Linux, however, also requires ever evolving methods of achieving compliance with the terms of our community’s chosen license, the GPL-2.0.
ja: しかしながら、Linuxの驚くべき成長と広範囲に渡る採用は、コミュニティが選択したライセンスGPL 2.0の遵守方法の発展をも必要としているのです。

source: Their ability to rely on this Additional Permission will hopefully re-establish user confidence and help direct enforcement activity back to the original purpose we have all sought over the years – actual compliance.
ja: この追加許諾に頼ることができるということが、できればユーザーに自信を回復させ、年来私たちが求めてきた当初の目的、真のコンプライアンス、へとコンプライアンス活動を向ける助けとなるでしょう。

source: Those authorized to ‘ack’ on behalf of their company may add their company name in (parenthesis) after their name as well.
ja: 企業を代表して承認する権限を与えられた者は、彼らの名前の後のカッコ内に企業名を追加することができます。

source: Unfortunately the same processes that we use to assure fulfillment of license obligations and availability of source code can also be used unjustly in trolling activities to extract personal monetary rewards.
ja: 残念ながら、ライセンス義務の履行とソースコード入手を確実にするコンプライアンス プロセスが、同時に、個人的な金銭的利益を稼ぐためのトロール活動（訳注：金銭目的で、自分の持つ著作権等の侵害を理由に企業を訴える行為）に不正に使えるのです。

source: While the kernel community has always supported enforcement efforts to bring companies into compliance, we have never even considered enforcement for the purpose of extracting monetary gain.
ja: Kernelコミュニティは、企業をコンプライアンス遵守に導く努力をいつも支援してきましたが、コンプライアンス遵守を金銭的利益を得る目的で利用することを考えたことは決してありません。

source: It adopts the same termination provisions we are all familiar with from GPL-3.0 as an Additional Permission giving companies confidence that they will have time to come into compliance if a failure is identified.
ja: それは、違反が発見されたときに、コンプライアンス状態へ正すための時間的猶予を企業に与える追加許諾（Additional Permission）として良く知られたGPL 3.0に由来する同じ終了条項を採用しています。

source: It is not possible to know an exact figure due to the secrecy of Patrick’s actions, but we are aware of activity that has resulted in payments of at least a few million Euros.
ja: パトリックは密かに活動していますので、正確な数字を知ることはできませんが、活動から少なくとも数百万ユーロを得たと私たちは考えています。

source: Some of us spend a lot of time traveling to different companies all around the world doing this, and lots of other people and groups have been working tirelessly to create practical guides for everyone to learn how to use Linux in a way that is compliant with the license.
ja: 私たちの中の数名は、これを成すために世界中のさまざまな企業を訪問することに多くの時間を費やしましたし、他の多くの人々は、すべての人がライセンスを遵守しながらLinuxを使う方法を理解できるよう、実績的ガイド作成に不断の努力をしてきました。

source: We are also aware that these actions, which have continued for at least four years, have threatened the confidence in our ecosystem.
ja: 彼の活動は少なくとも4年は継続しており、私たちのエコシステムに対する信頼を脅かしていることを私たちは認識しています。
